W7D2/my_project_name/app/models/user.rb

  def reset_session_token!
    self.update!(session_token: SecureRandom.urlsafe_base64(16))
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "zBk2URev9jHkOFfYGwXjJQ"], ["updated_at", "2019-10-01 23:30:23.805594"], ["id", 1]]

  def password=(password)
    self.password_digest = BCrypt::Password.create(password)
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"