w6d4/classWorkTest/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 6]]
---
  def create
    artwork_share = ArtworkShare.new(user_params)
    if artwork_share.save!