w6d4/classWorkTest/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."artist_id" = $1  [["artist_id", 4]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 3]]
SELECT  1 AS one FROM "comments" WHERE "comments"."artwork_id" = $1 LIMIT $2  [["artwork_id", 3], ["LIMIT", 1]]
---
  def index
    if params.has_key?(:user_id)
      comments = Comment.where(artist_id: params[:user_id])
    elsif params.has_key?(:artwork_id)
      comments = Comment.where(artwork_id: params[:artwork_id])
    end
    if comments.empty?

INSERT INTO "comments" ("artist_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artist_id", 4], ["artwork_id", 3], ["body", "Kewl"], ["created_at", "2019-09-26 21:29:41.655567"], ["updated_at", "2019-09-26 21:29:41.655567"]]
---
  def create
    new_comment = Comment.new(comment_params)
    if new_comment.save!