w6d4/classWorkTest/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE (tommy01) LIMIT $1  [["LIMIT", 1]]
---
  def index
    if params[:id]
      users = User.find(params[:id])
    else
      users = User.all

INSERT INTO "users" ("email", "name") VALUES ($1, $2) RETURNING "id"  [["email", "alknsflka@gmail.com"], ["name", "Latte"]]
---
  def create
    user = User.new(user_params)
    if user.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "dog"], ["id", 5]]
---
  def update
    user = User.find(params[:id])
    if user.update(user_params)