W7D2/my_project_name/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "LNOwL9jwH0Dryn3sloTIrw"], ["LIMIT", 1]]
---
  def current_user
    return nil unless session[:session_token]
    User.find_by(session_token: session[:session_token])