W7D2/my_project_name/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    login!(@user)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"