W7D3/goalapp/app/models/user.rb

UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "8tBGh5zBnPK-2rOgVYgtKw"], ["updated_at", "2019-10-02 23:50:33.098556"], ["id", 1]]
---
  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save